# Префиксные суммы и два указателя
*Тут представлены задачи, которые решаются с помощью префиксных сумм или двух указателей*

---
# Задача 1 (Префиксная сумма)

Дана последовательность чисел. Нужно вычислить последовательность ее префиксных сумм

### **Формат ввода**

В первой строке передается число *n* - количество чисел в последовательности (1 <= *n* <= 10<sup>3</sup>)

В следующей строке передается *n* чисел. Каждое число не превосходит по модулю 10<sup>6</sup>

### **Формат вывода**

В ответе выведите последовательность префиксных сумм (*n* чисел)

### Пример
```
5
1 2 3 4 5  ->  1 3 6 10 15
```

## Объяснение решения

Задача нужна исключительно для того, чтобы познакомиться с тем, что такое префиксная сумма. Массив префиксных сумм - это массив длины *n*+1, в котором в ячейке с индексом 0 стоит 0, а в *i*-ых (*i* != 0) - сумма первых *i* элементов последовательности. Префиксная сумма легко помогает дать ответ на вопрос: "чему равна сумма элементов на отрезке [*L*; *R*]" - она равна *массив*[*R* + 1] - *массив*[*L*]

```python
n = int(input())
nums = list(map(int, input().split()))
prefix_sums = [0] * (n + 1)
for i in range(1, n + 1):
    prefix_sums[i] = prefix_sums[i - 1] + nums[i - 1]
    print(prefix_sums[i], end=' ')
```

# Задача 2 (сумма на отрезках)

Дана последовательность чисел из *N* элементов. Далее идут *q* запросов в виде: *L* *R*, для которых нужно ответить чему равна сумма на отрезке [*L*; *R*]

*Примечание: запросы составляются самостоятельно по определенному алгоритму:*

*1. Генерируется последовательность чисел X<sub>0</sub>, ..., X<sub>2q-1</sub> по формуле: X<sub>i</sub> = (11173 * X<sub>i-1</sub> + 1)mod1000000007*

*2. Генерируются числа L<sub>0</sub>, ..., L<sub>q-1</sub> и R<sub>0</sub>, ..., R<sub>q-1</sub> по формулам: L<sub>0</sub> = min(X<sub>0</sub>modN, X<sub>1</sub>modN), R<sub>0</sub> = max(X<sub>0</sub>modN, X<sub>1</sub>modN); L<sub>1</sub> = min(X<sub>2</sub>modN, X<sub>3</sub>modN), R<sub>2</sub> = max(X<sub>2</sub>modN, X<sub>3</sub>modN) и т.д*

### **Формат ввода**

В первой строке передается число *N* - количество чисел в последовательности (1 <= *N* <= 10<sup>5</sup>)

В следующей строке передается *N* чисел. Каждое число не превосходит по модулю 10<sup>9</sup>

В третьей строке передается число *q* - количество запросов (1 <= *q* <= 10000)

В четвертой строке передается число *X<sub>0</sub>* - начальное число для генерации другиз чисел (0 <= *X<sub>0</sub>* <= 10<sup>9</sup>)

### **Формат вывода**

В ответе выведите одно число - остаток от деления суммы всех результатов запросов на 1000000007

### Пример
```
5
1 2 3 4 5   ->  27
3
123

7
34 10 49 32 28 15 70  ->  492
5
0
```

## Объяснение решения

Здесь воспользуемся тем же массивом префиксных сумм. Главное - правильно прочитать условие и написать генератор чисел. Кроме того, при подсчете суммы всех запросов, каждый раз пользуемся операцией *%*, так как если случится переполнение - то ответ может выйти совершенно другой

```python
def get_sequence(x0):
  x1 = (11173 * x0 + 1) % 1000000007
  return x1

def get_l_r(x0, x1, n):
  l0 = min(x0 % n, x1 % n)
  r0 = max(x0 % n, x1 % n)
  return l0, r0

n = int(input())
nums = list(map(int, input().split()))
q = int(input())
x0 = int(input())
prefix_sums = [0] * (n + 1)
for i in range(1, n + 1):
    prefix_sums[i] = prefix_sums[i - 1] + nums[i - 1]

ans = 0
x1 = get_sequence(x0)
for i in range(q):
    l, r = get_l_r(x0, x1, n)
    ans = (ans + prefix_sums[r + 1] - prefix_sums[l]) % 1000000007
    x0 = get_sequence(x1)
    x1 = get_sequence(x0)
print(ans % 1000000007)
```
