# Префиксные суммы и два указателя
*Тут представлены задачи, которые решаются с помощью префиксных сумм или двух указателей*

---
# Задача 1 (Префиксная сумма)

Дана последовательность чисел. Нужно вычислить последовательность ее префиксных сумм

### **Формат ввода**

В первой строке передается число *n* - количество чисел в последовательности (1 <= *n* <= 10<sup>3</sup>)

В следующей строке передается *n* чисел. Каждое число не превосходит по модулю 10<sup>6</sup>

### **Формат вывода**

В ответе выведите последовательность префиксных сумм (*n* чисел)

### Пример
```
5
1 2 3 4 5  ->  1 3 6 10 15
```

## Объяснение решения

Задача нужна исключительно для того, чтобы познакомиться с тем, что такое префиксная сумма. Массив префиксных сумм - это массив длины *n*+1, в котором в ячейке с индексом 0 стоит 0, а в *i*-ых (*i* != 0) - сумма первых *i* элементов последовательности. Префиксная сумма легко помогает дать ответ на вопрос: "чему равна сумма элементов на отрезке [*L*; *R*]" - она равна *массив*[*R* + 1] - *массив*[*L*]

```python
n = int(input())
nums = list(map(int, input().split()))
prefix_sums = [0] * (n + 1)
for i in range(1, n + 1):
    prefix_sums[i] = prefix_sums[i - 1] + nums[i - 1]
    print(prefix_sums[i], end=' ')
```

# Задача 2 (Сумма на отрезках)

Дана последовательность чисел из *N* элементов. Далее идут *q* запросов в виде: *L* *R*, для которых нужно ответить чему равна сумма на отрезке [*L*; *R*]

*Примечание: запросы составляются самостоятельно по определенному алгоритму:*

*1. Генерируется последовательность чисел X<sub>0</sub>, ..., X<sub>2q-1</sub> по формуле: X<sub>i</sub> = (11173 * X<sub>i-1</sub> + 1)mod1000000007*

*2. Генерируются числа L<sub>0</sub>, ..., L<sub>q-1</sub> и R<sub>0</sub>, ..., R<sub>q-1</sub> по формулам: L<sub>0</sub> = min(X<sub>0</sub>modN, X<sub>1</sub>modN), R<sub>0</sub> = max(X<sub>0</sub>modN, X<sub>1</sub>modN); L<sub>1</sub> = min(X<sub>2</sub>modN, X<sub>3</sub>modN), R<sub>2</sub> = max(X<sub>2</sub>modN, X<sub>3</sub>modN) и т.д*

### **Формат ввода**

В первой строке передается число *N* - количество чисел в последовательности (1 <= *N* <= 10<sup>5</sup>)

В следующей строке передается *N* чисел. Каждое число не превосходит по модулю 10<sup>9</sup>

В третьей строке передается число *q* - количество запросов (1 <= *q* <= 10000)

В четвертой строке передается число *X<sub>0</sub>* - начальное число для генерации другиз чисел (0 <= *X<sub>0</sub>* <= 10<sup>9</sup>)

### **Формат вывода**

В ответе выведите одно число - остаток от деления суммы всех результатов запросов на 1000000007

### Пример
```
5
1 2 3 4 5   ->  27
3
123

7
34 10 49 32 28 15 70  ->  492
5
0
```

## Объяснение решения

Здесь воспользуемся тем же массивом префиксных сумм. Главное - правильно прочитать условие и написать генератор чисел. Кроме того, при подсчете суммы всех запросов, каждый раз пользуемся операцией *%*, так как если случится переполнение - то ответ может выйти совершенно другой

```python
def get_sequence(x0):
  x1 = (11173 * x0 + 1) % 1000000007
  return x1

def get_l_r(x0, x1, n):
  l0 = min(x0 % n, x1 % n)
  r0 = max(x0 % n, x1 % n)
  return l0, r0

n = int(input())
nums = list(map(int, input().split()))
q = int(input())
x0 = int(input())
prefix_sums = [0] * (n + 1)
for i in range(1, n + 1):
    prefix_sums[i] = prefix_sums[i - 1] + nums[i - 1]

ans = 0
x1 = get_sequence(x0)
for i in range(q):
    l, r = get_l_r(x0, x1, n)
    ans = (ans + prefix_sums[r + 1] - prefix_sums[l]) % 1000000007
    x0 = get_sequence(x1)
    x1 = get_sequence(x0)
print(ans % 1000000007)
```

# Задача 3 (Максимальная сумма)

Дана последовательность из *n* чисел. Нужно вычислить максимальную сумму, среди всех отрезков [*L*; *R*]

### **Формат ввода**

В первой строке передается число *n* - количество чисел в последовательности (1 <= *n* <= 3*10<sup>5</sup>)

В следующей строке передается *n* чисел. Каждое число не превосходит по модулю 10<sup>9</sup>

### **Формат вывода**

В ответе выведите максимальную сумму среди всех отрезков

### Пример
```
4
1 2 3 4    ->    10

4
5 4 -10 4    ->    9

4
5 -2 18 1    ->    22
```

## Объяснение решения

Максимальная сумма может быть как положительной, так и отрицательной (и еще 0, но отнесем его в случай отрицательных). С положительной все понятно - это первое, что нам приходит в голову. Но отрицательной она может быть только в том случае, если ни на каком подотрезке нет положительной суммы, значит, ответ это наибольший элемент последовательности. Но в большинстве случаев нам предстоит решить задачу по поиску положительной суммы. Тут есть несколько подходов

1. Давайте суммировать элементы последовательности, пока их сумма положительна. Если она стала отрицательной, то мы сбрасываем текцщую префиксную сумму и начинаем заново с места, где остановились. Логика довольно проста: зачем нам добавлять в накопившуюся сумму еще элементы, если она уже отрицательна, проще взять следующий элемент, ведь он будет больше, чем вся префиксная сумма.

```python
n = int(input())
nums = list(map(int, input().split()))
mx_sum = nums[0]
now_sum = 0
for i in range(n):
    now_sum += nums[i]
    mx_sum = max(mx_sum, now_sum)
    if now_sum < 0:
        now_sum = 0
print(mx_sum)
```

2. Второй подход заключается в нахождении текущей минимальной префиксной суммы. Давайте рассмотрим 2-ой пример: массив префиксных сумм выгядит так [0, 5, 9, -1, 3]. На каждом шаге мы будем высчитывать текущую префиксную сумму, а также запоминать, какая префиксная сумма была минимальной к текущему моменту. Ответом будет максимальная разница между текущей префиксной суммой и последней минимальной. То есть для в примере на 1 шаге минимальная - 0, текущая - 5, разница - 5; на втором - 0 9 9; на 3-ем -1 -1 0; на 4-ом -1 3 4. Ответ: 9

```python
n = int(input())
nums = list(map(int, input().split()))
mn_sum = 0
now_sum = 0
mx_sum = nums[0]
for i in range(n):
    now_sum += nums[i]
    mx_sum = max(mx_sum, now_sum - mn_sum)
    mn_sum = min(mn_sum, now_sum)
print(mx_sum)
```

# Задача 4 (Количество сумм)

Дана последовательность из *n* чисел. Нужно вычислить количество отрезков, на которых сумма элементов равна некоторому числу *k*

### **Формат ввода**

В первой строке передается два числа: *n* - количество чисел в последовательности и *k* (1 <= *n* <= 10<sup>5</sup>; 1 <= *k* <= 10<sup>9</sup>)

В следующей строке передается *n* чисел. Каждое число натуральное и не превосходит 999

### **Формат вывода**

В ответе выведите количество отрезков, на которых сумма равна *k*

### Пример
```
5 17
17 7 10 7 10    ->    4

5 10
1 2 3 4 1    ->    2
```

## Объяснение решения

Пусть массив префиксных сумм - pref. Нам нужно найти такие отрезки, что *pref*[*R*] - *pref*[*L*] = *k*, значит, *pref*[*R*] - *k* = *pref*[*L*]. Пусть *R* - это текущая префиксная сумма, тогда нам нужно знать, была ли такая сумма *pref*[*R*] - *k*. Для этого воспользуемся словарем, на каждой итерации будем подсчитывать количество сумм, равных *pref*[*R*] - *k*

```python
n, k = map(int, input().split())
nums = list(map(int, input().split()))
sums = {0: 1}
prefix_sum = 0
count = 0
for i in range(n):
    prefix_sum += nums[i]
    if prefix_sum - k in sums:
        count += sums[prefix_sum - k]
    if prefix_sum not in sums:
        sums.update({prefix_sum: 0})
    sums[prefix_sum] += 1
print(count)
```
