# Структуры данных
*В данном разделе будут представлены алгоритмические задачи, требующие использования различных структур данных*

---
# Задача 1 (различные чилса)

На вход подается список чисел. Нужно определить количество различных значений

### **Формат ввода**

В первой строке передается список чисел (не больше 10<sup>5</sup> элементов)

### **Формат вывода**

В ответе укажите количество различных чисел

### Пример
```
1 2 3 4 5  ->  5
3 2 3 8 2  ->  3
```

## Объяснение решения

Для решения данной задачи подойдет такая структура данных как множество: в нем каждый элемент может храниться только 1 раз. В питоне оно задается как *set()*. Добавление элемента *x* происходит через метод *add()*: *add(x)*

```python
s = set()
arr = list(map(int, input().split()))
for i in arr:
    s.add(i)
print(len(s))
```

---
# Задача 2 (было ли раньше?)

Во входной строке передан список элементов. Для каждого числа нужно сказать, встречалось ли оно раньше или нет, после чего вывести ответ на экран

### **Формат ввода**

На вход подается список чисел

### **Формат вывода**

В ответе для каждого числа напечатайте 'YES', если оно уже встречалось, и 'NO' в противном случае

### Пример
```
1 2 3  ->  NO
           NO
           NO

4 5 4  ->  NO
           NO
           YES
```

## Объяснение решения

В этой задаче можно так же воспользоваться множетсвом, но попробуем реализовать решение, используя словарь. Словарь - структура данных, в которой элементы хранятся по системе ключ-значение. В питоне оно задается как *dict()* или *{}*. В этом решении ключом у нас будет выступать само число, а значением единица. Добавление нового ключа *x* со значением *y* происходит через метод *update()*: *update({x: y})*

```python
d = dict()
arr = list(map(int, input().split()))
for i in arr:
    if i not in d:
       print('NO')
       d.update({i: 1})
    else:
       print('YES')
```
