# Структуры данных
*В данном разделе будут представлены алгоритмические задачи, требующие использования различных структур данных*

---
# Задача 1 (различные чилса)

На вход подается список чисел. Нужно определить количество различных значений

### **Формат ввода**

В первой строке передается список чисел (не больше 10<sup>5</sup> элементов)

### **Формат вывода**

В ответе укажите количество различных чисел

### Пример
```
1 2 3 4 5  ->  5
3 2 3 8 2  ->  3
```

## Объяснение решения

Для решения данной задачи подойдет такая структура данных как множество: в нем каждый элемент может храниться только 1 раз. В питоне оно задается как *set()*. Добавление элемента *x* происходит через метод *add()*: *add(x)*

```python
s = set()
arr = list(map(int, input().split()))
for i in arr:
    s.add(i)
print(len(s))
```

---
# Задача 2 (было ли раньше?)

Во входной строке передан список элементов. Для каждого числа нужно сказать, встречалось ли оно раньше или нет, после чего вывести ответ на экран

### **Формат ввода**

На вход подается список чисел

### **Формат вывода**

В ответе для каждого числа напечатайте 'YES', если оно уже встречалось, и 'NO' в противном случае

### Пример
```
1 2 3  ->  NO
           NO
           NO

4 5 4  ->  NO
           NO
           YES
```

## Объяснение решения

В этой задаче можно так же воспользоваться множетсвом, но попробуем реализовать решение, используя словарь. Словарь - структура данных, в которой элементы хранятся по системе ключ-значение. В питоне оно задается как *dict()* или *{}*. В этом решении ключом у нас будет выступать само число, а значением единица. Добавление нового ключа *x* со значением *y* происходит через метод *update()*: *update({x: y})*

```python
d = dict()
arr = list(map(int, input().split()))
for i in arr:
    if i not in d:
       print('NO')
       d.update({i: 1})
    else:
       print('YES')
```

# Задача 3 (пересечение списков)

Даны 2 списка с числами. Нужно вывести в порядке неубывания значения, которые встречаются как в 1, так и во 2 списках

### **Формат ввода**

В первой строке передается первый список

Во второй строке передается второй список

### **Формат вывода**

В ответе выведите числа, что встречаются в двух списках в порядке неубывания

### Пример
```
1 2 3
8 1 4    ->    1

7 2 5
2 8 7    ->    2 7
```

## Объяснение решения

Воспользуемся множеством. Решение довольно короткое и простое, в подробном объяснении не требуется

```python
s1 = set(map(int ,input().split()))
s2 = set(map(int, input().split()))
for i in sorted(s1):
    if i in s2:
        print(i, end=' ')
```

# Задача 4 (школьники и языки)

Всего *n* учеников. Каждый *i*-й ученик знает *M<sub>i</sub>* языков. Опеределите языки, которые знают все школьники, и языки, которые знает хотя бы один школьник

### **Формат ввода**

В первой стороке передается число *n* - количество учеников (1 <= *n* <= 1000)

Далее идёт *n* блоков - информации об учениках. В каждом *i*-м блоке в первой строке передается число *M<sub>i</sub>* - количество языков, который знает ученик *i* (1 <= *M<sub>i</sub> <= 500). Далее в последующих *M<sub>i</sub>* строках записаны языки - по одному в строке

### **Формат вывода**

В первой строке укажите количество языков, которые знают все ученики. Со второй строки - перечисление этих языков (каждыый на новой строке)

Потом укажите количество языков, которые знает хотя бы один ученик. Со следующей строки - перечисление этих языков (каждый на новой строке)

### Пример
```
3
3            
Russian            1
English            Russian
Chinese            3
2            ->    Russian   
Russian            Chinese
English            English
1
Russian
```

## Объяснение решения

Воспользуемся словарями и множествами (но вообще, можно было и без множеств). Ключами в словарях будут названия языков, значениями - количество учеников, что их знает. В множестве будем просто хранить языки, которые знают все. В решении будет использован метод *keys()* - он возращает список всех ключей в словаре

```python
n = int(input())
all_lang = dict() #словарь с языками и количеством учеников, знающих их
s = set()
for i in range(n):
    mi = int(input())
    for j in range(mi):
        lang = input()
        if lang not in all_lang: #добавляем новый язык в словарь и ставим ему значени 0
            all_lang.update({lang: 0})
        all_lang[lang] += 1 #увеличиваем значение на 1

for l in list(all_lang.keys()):
    if all_lang[l] == n: #если язык знают все - добавляем в множество
        s.add(l)
            
print(len(s))
print('\n'.join(s))
print(len(all_lang.keys()))
print('\n'.join(all_lang.keys()))
```

# Задача 5 (гонка черепах)

В гонке участвует *n* черепах. Каждая из черепах говорит сколько черепах перед ней и позади нее, но они могут врать. Нужно определить какое максимальное количество черепах может говорить правду

### **Формат ввода**

В первой строке передается число *n* - количество черепах в гонке (1 <= *n* <= 10000)

В следущих *n* строках записаны показания каждой из черепах: число *a<sub>i</sub>* черепах перед ней и число *b<sub>i</sub>* позади нее (|*a<sub>i</sub>*|, |*b<sub>i</sub>*| <= 10000)

### **Формат вывода**

В ответе укажите максимальное число черепах, которые могут говорить правду

### Пример
```
3
2 0
0 2    ->    2
2 2

5
0 4
1 3
2 2    ->    5
3 1
4 0
```

## Объяснение решения

В каком случае черепаха может врать? Если суммарное количество черепах перед ней и позади нее не равно *n*-1, либо если две черепахи находятся на одном и том же месте, либо число черепах спереди или сзади отрицательное (обратите внимание, что значения ограничены по модулю). Если первое и последнее условие мы легко сможем обработать, то для второго нам помогут множества

```python
n = int(input())
s = set()
for i in range(n):
    a, b = map(int, input().split())
    if (a + b) == (n - 1) and (a >= 0) and (b >= 0):
        s.add((a, b))
print(len(s))
```

# Задача 6 (синонимы)

Вам дан список из *n* пар слов. Каждая пара слов являются синонимами. Все слова различны. Для данного слова выведите его синоним

### **Формат ввода**

В первой строке передается число *n* - количество пар синонимов

Далее в *n* строках вводятся пары слов через пробел

В последней строке передается одно слово

### **Формат вывода**

В ответе укажите слово, которое является синонимом к данному

### Пример
```
3
Good Brilliant
Wow OMG        ->        Hello
Hello Hi
Hi
```

## Объяснение решения

Для решения этой задачи идеально подходит словарь. Ключом будет один синоним, а значением другой. Будем добавлять пару дважды, меняя синонимы местами (ключ и значение)

```python
d = dict()
n = int(input())
for _ in range(n):
    s1, s2 = input().split()
    d[s1] = s2
    d[s2] = s1
s = input()
print(d[s])
```
