# Простые алгоритмы
*Тут будут задачки на достаточно примитивные алгоритмы, а так же задачки, которые не относятся ни к одной из других тем*

---
# Задача 1 (кодирование строки)

В строке буквы с 'a' по 'i' кодируются числами от 1 до 9 соответственно, а буквы с 'j' по 'z' - символами 10# до 26# соответственно. Нужно раскодировать строку

### **Формат ввода**

В первой строке передается строка s (длина строки 1 <= |s| <= 100), которая состоит из цифр и символа '#'. Гарантируется, что данная строка была получена путем кодирования некоторой другой строки

### **Формат вывода**

Нужно вывести раскодированную строку

### Пример
```
123 -> abc
8512#12#15# -> hello
```

## Объяснение решения

Буква у нас может быть закодирована только одним из двух случаев: либо одной цифрой, либо двумя цифрами и символом '#'. На каждой итерации цикла будем проверять i+2 элемент: если он равен '#', то это означает, что перед нами буква среди 'j' - 'z', иначе 'a' - 'i'. Будем пользоваться функциями *ord()* и *chr()*: *ord()* возвращает номер символа в таблице Unicode; *chr()* возвращает символ по коду. Данное решение работает за O(n)

```python
s = input()
i = 0
while (i < len(s)):
    if (i + 2 < len(s) and s[i + 2] == '#'): #проверяем i+2 символ, и смотрим на границы строки
        dig = (ord(s[i]) - ord('0')) * 10 + ord(s[i + 1]) - ord('0') 
        print(chr(ord('a') + dig - 1), end = '')
        i += 3
    else:
        print(chr(ord('a') + ord(s[i]) - ord('0') - 1), end = '')
        i += 1
```

# Задача 2 (Покраска деревьев)

Вася и Маша решили покрасить деревья. Деревья растут вдоль одной прямой и расположены на расстоянии 1 метр друг от друга. Каждое дерево имеет координату (например: 4; -6; 0). Вася и Маша стоят у деревьев с номерами p и q соответственно. Около этих деревьев стоит банка с краской, которую ребята перемащать не могут: они макают в банку кисть и идут красить деревья. Вася может отойти от банки не более чем на v метров, после чего краска на кисти засыхает, Маша - не более чем на m метров. Какое максимальное количество деревьев ребята могут покрасить?

### **Формат ввода**

В первой строке поступают данные для Васи: номер дерева p и количество метров q, которое он может пройти до высыхания краски
Во второй строке

### **Формат вывода**

Нужно вывести раскодированную строку

### Пример
```
123 -> abc
8512#12#15# -> hello
```

## Объяснение решения
